singlemachine.out
------- fio random write testm-1  -------
{u'changed': True, u'end': u'2018-10-02 15:54:53.690398', u'stdout': u'benchmark: (g=0): rw=randwrite, bs=16K-16K/16K-16K/16K-16K, ioengine=libaio, iodepth=128\n...\nfio-2.2.10\nStarting 4 processes\nbenchmark: Laying out IO file(s) (1 file(s) / 10240MB)\n\nbenchmark: (groupid=0, jobs=4): err= 0: pid=20030: Tue Oct  2 15:54:53 2018\n  write: io=12063MB, bw=411656KB/s, iops=25728, runt= 30006msec\n    slat (usec): min=3, max=27389, avg=151.42, stdev=306.65\n    clat (msec): min=1, max=74, avg=19.74, stdev= 4.93\n     lat (msec): min=1, max=74, avg=19.89, stdev= 4.96\n    clat percentiles (usec):\n     |  1.00th=[ 7200],  5.00th=[12608], 10.00th=[14656], 20.00th=[17024],\n     | 30.00th=[18048], 40.00th=[18816], 50.00th=[19584], 60.00th=[20096],\n     | 70.00th=[20864], 80.00th=[21888], 90.00th=[23936], 95.00th=[27776],\n     | 99.00th=[38656], 99.50th=[41728], 99.90th=[49920], 99.95th=[54528],\n     | 99.99th=[61696]\n    bw (KB  /s): min=55856, max=150848, per=25.00%, avg=102918.96, stdev=16195.07\n    lat (msec) : 2=0.01%, 4=0.09%, 10=2.00%, 20=54.99%, 50=42.82%\n    lat (msec) : 100=0.10%\n  cpu          : usr=2.14%, sys=11.85%, ctx=563111, majf=0, minf=43\n  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%\n     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%\n     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%\n     issued    : total=r=0/w=772009/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0\n     latency   : target=0, window=0, percentile=100.00%, depth=128\n\nRun status group 0 (all jobs):\n  WRITE: io=12063MB, aggrb=411655KB/s, minb=411655KB/s, maxb=411655KB/s, mint=30006msec, maxt=30006msec\n\nDisk stats (read/write):\n  vda: ios=0/769704, merge=0/10435, ticks=0/3700376, in_queue=3703980, util=99.79%', u'cmd': u'fio --time_based --name=benchmark --size=10G --runtime=30 --filename=fio-random-write --ioengine=libaio --randrepeat=0 --iodepth=128 --direct=1 --invalidate=1 --verify=0 --verify_fatal=0 --numjobs=4 --rw=randwrite --blocksize=16k --group_reporting', u'start': u'2018-10-02 15:54:23.288623', u'delta': u'0:00:30.401775', u'stderr': u'', u'rc': 0, 'stdout_lines': [u'benchmark: (g=0): rw=randwrite, bs=16K-16K/16K-16K/16K-16K, ioengine=libaio, iodepth=128', u'...', u'fio-2.2.10', u'Starting 4 processes', u'benchmark: Laying out IO file(s) (1 file(s) / 10240MB)', u'', u'benchmark: (groupid=0, jobs=4): err= 0: pid=20030: Tue Oct  2 15:54:53 2018', u'  write: io=12063MB, bw=411656KB/s, iops=25728, runt= 30006msec', u'    slat (usec): min=3, max=27389, avg=151.42, stdev=306.65', u'    clat (msec): min=1, max=74, avg=19.74, stdev= 4.93', u'     lat (msec): min=1, max=74, avg=19.89, stdev= 4.96', u'    clat percentiles (usec):', u'     |  1.00th=[ 7200],  5.00th=[12608], 10.00th=[14656], 20.00th=[17024],', u'     | 30.00th=[18048], 40.00th=[18816], 50.00th=[19584], 60.00th=[20096],', u'     | 70.00th=[20864], 80.00th=[21888], 90.00th=[23936], 95.00th=[27776],', u'     | 99.00th=[38656], 99.50th=[41728], 99.90th=[49920], 99.95th=[54528],', u'     | 99.99th=[61696]', u'    bw (KB  /s): min=55856, max=150848, per=25.00%, avg=102918.96, stdev=16195.07', u'    lat (msec) : 2=0.01%, 4=0.09%, 10=2.00%, 20=54.99%, 50=42.82%', u'    lat (msec) : 100=0.10%', u'  cpu          : usr=2.14%, sys=11.85%, ctx=563111, majf=0, minf=43', u'  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%', u'     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%', u'     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%', u'     issued    : total=r=0/w=772009/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0', u'     latency   : target=0, window=0, percentile=100.00%, depth=128', u'', u'Run status group 0 (all jobs):', u'  WRITE: io=12063MB, aggrb=411655KB/s, minb=411655KB/s, maxb=411655KB/s, mint=30006msec, maxt=30006msec', u'', u'Disk stats (read/write):', u'  vda: ios=0/769704, merge=0/10435, ticks=0/3700376, in_queue=3703980, util=99.79%'], u'warnings': []}
==============
------- fio random read testm-1  -------
benchmark: (g=0): rw=randread, bs=16K-16K/16K-16K/16K-16K, ioengine=libaio, iodepth=128
...
fio-2.2.10
Starting 4 processes
benchmark: Laying out IO file(s) (1 file(s) / 10240MB)

benchmark: (groupid=0, jobs=4): err= 0: pid=20156: Tue Oct  2 15:55:34 2018
  read : io=15295MB, bw=522047KB/s, iops=32627, runt= 30002msec
    slat (usec): min=2, max=13816, avg=118.83, stdev=524.08
    clat (usec): min=927, max=140004, avg=15561.92, stdev=16105.43
     lat (usec): min=936, max=140204, avg=15681.29, stdev=16215.37
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[    5], 10.00th=[    5], 20.00th=[    6],
     | 30.00th=[    9], 40.00th=[   10], 50.00th=[   13], 60.00th=[   15],
     | 70.00th=[   16], 80.00th=[   17], 90.00th=[   23], 95.00th=[   58],
     | 99.00th=[   86], 99.50th=[   93], 99.90th=[  109], 99.95th=[  114],
     | 99.99th=[  124]
    bw (KB  /s): min=25408, max=244320, per=25.01%, avg=130538.47, stdev=62188.55
    lat (usec) : 1000=0.01%
    lat (msec) : 2=0.01%, 4=4.29%, 10=37.45%, 20=47.08%, 50=4.96%
    lat (msec) : 100=5.96%, 250=0.25%
  cpu          : usr=2.05%, sys=9.65%, ctx=321774, majf=0, minf=2087
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=978904/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: io=15295MB, aggrb=522047KB/s, minb=522047KB/s, maxb=522047KB/s, mint=30002msec, maxt=30002msec

Disk stats (read/write):
  vda: ios=978146/5, merge=0/1, ticks=3715588/20, in_queue=3716728, util=99.74%
==============